app/controllers/ators_controller.rb

  def index
    @ators = Ator.all
---
SELECT "ators".* FROM "ators"

  def create
    @ator = Ator.new(ator_params)

    respond_to do |format|
      if @ator.save
---
INSERT INTO "ators" ("nome", "nome_artistico", "nacionalidade", "idade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "dfmnmnds,"], ["nome_artistico", ""], ["nacionalidade", ""], ["idade", ""], ["created_at", "2017-11-12 18:34:20.030820"], ["updated_at", "2017-11-12 18:34:20.030820"]]

  def update
    respond_to do |format|
      if @ator.update(ator_params)
---
UPDATE "ators" SET "nome" = ?, "updated_at" = ? WHERE "ators"."id" = ?  [["nome", ""], ["updated_at", "2017-11-12 18:34:27.690479"], ["id", 2]]

  def destroy
    @ator.destroy
---
DELETE FROM "ators" WHERE "ators"."id" = ?  [["id", 2]]

    def set_ator
      @ator = Ator.find(params[:id])
---
SELECT  "ators".* FROM "ators" WHERE "ators"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]