app/controllers/estudios_controller.rb

  def index
    @estudios = Estudio.all
---
SELECT "estudios".* FROM "estudios"

  def create
    @estudio = Estudio.new(estudio_params)

    respond_to do |format|
      if @estudio.save
---
INSERT INTO "estudios" ("nome", "nome_dono", "data_fundacao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "kfnjkdfsnkjgf"], ["nome_dono", ""], ["data_fundacao", "2017-11-10"], ["created_at", "2017-11-12 18:37:58.361254"], ["updated_at", "2017-11-12 18:37:58.361254"]]

  def destroy
    @estudio.destroy
---
DELETE FROM "estudios" WHERE "estudios"."id" = ?  [["id", 2]]

    def set_estudio
      @estudio = Estudio.find(params[:id])
---
SELECT  "estudios".* FROM "estudios" WHERE "estudios"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]