app/controllers/filmes_controller.rb

  def index
    @filmes = Filme.all
---
SELECT "filmes".* FROM "filmes"