app/controllers/papels_controller.rb

SELECT "papels".* FROM "papels"
---
  def index
    @papels = Papel.all