app/controllers/personagems_controller.rb

  def index
    @personagems = Personagem.all
---
SELECT "personagems".* FROM "personagems"